t21/Walnut_X/Packages/.cache/Keil.Kinetis_KMxx_DFP.1.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KMxx_DFP</name>
  <description>Freescale Kinetis KMxx Series Device Support and Examples</description>

  <releases>
    <release version="1.2.0" date="2015-06-03">
      Added Device Support for: MKM34Z2567.
      Added TWR-KM34Z50MV3 board support.
      Updated RTX Blinky examples.
      Reworked conditions.
    </release>
    <release version="1.1.0" date="2014-11-03">
      Added Device Support for: KM14Z64A  KM14Z128A  KM33Z64A  KM33Z128A  KM34Z128A.
      SRAM range correction.
    </release>
    <release version="1.0.1">
      Added Device Support for: MKM13Z64xxx5, MKM32Z64xxx5, MKM38Z128xxx5.
    </release>
    <release version="1.0.0">
      First Release version of KMxx Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Freescale</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Freescale</keyword>
    <keyword>KMxx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="KMxx Series" Dvendor="Freescale:78">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <book name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>

      <!-- ******************************  KM1x  ****************************** -->
      <subFamily DsubFamily="KM1x">
        <description>
Kinetis KM1x MCUs are based upon the low-power ARM Cortex-M0+ core and are designed
for single-chip one-two- and three -phase electricity meters, as well as flow meter
and other precision measurement applications.
Kinetis KM1x MCUs include a powerful analog front end consisting of multiple 24-bit
sigma delta ADCs, programmable gain amplifiers, voltage reference with low drift over
temperature and a phase shift compensator.
A large range of security features including a memory protection unit, external
tamper detection pins, iRTC with tamper detect and a random number generator provide
protection of supplier/user data within the MCU and from the MCU to the power grid.
        </description>

        <!-- ******************************  MKM13Z64xxx5  ****************************** -->
        <device Dname="MKM13Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM13Z5.h"  define="MKM13Z64xxx5"/>
          <debug      svd="SVD\MKM13Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP64_1KB.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        </device>

        <!-- ******************************  MKM14Z128xxx5  ****************************** -->
        <device Dname="MKM14Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM14Z5.h"  define="MKM14Z128xxx5"/>
          <debug      svd="SVD\MKM14Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxCxx5RM.pdf" title="MKM14Z128xxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxCxx5.pdf"   title="MKM14Z128xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM14Z64xxx5  ****************************** -->
        <device Dname="MKM14Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM14Z5.h"  define="MKM14Z64xxx5"/>
          <debug      svd="SVD\MKM14Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP64_1KB.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxCxx5RM.pdf" title="MKM14Z64xxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxCxx5.pdf"   title="MKM14Z64xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM14Z64Axxx5  ****************************** -->
        <device Dname="MKM14Z64Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM14ZA5.h"  define="MKM14Z64Axxx5"/>
          <debug      svd="SVD\MKM14ZA5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP64_1KB.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM14Z128Axxx5  ****************************** -->
        <device Dname="MKM14Z128Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM14ZA5.h"  define="MKM14Z128Axxx5"/>
          <debug      svd="SVD\MKM14ZA5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KM3x  ****************************** -->
      <subFamily DsubFamily="KM3x">
        <description>
Kinetis KM3x MCUs are based upon the low-power ARM Cortex-M0+ core and are designed
for single-chip one-two- and three -phase electricity meters, as well as flow meter
and other precision measurement applications.
Kinetis KM3x MCUs include a powerful analog front end consisting of multiple 24-bit
sigma delta ADCs, programmable gain amplifiers, voltage reference with low drift over
temperature and a phase shift compensator.
A large range of security features including a memory protection unit, external
tamper detection pins, iRTC with tamper detect and a random number generator provide
protection of supplier/user data within the MCU and from the MCU to the power grid.
A low-power segment LCD controller support up to 288 segments and eight backplanes.
        </description>

        <!-- ******************************  MKM32Z64xxx5  ****************************** -->
        <device Dname="MKM32Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM32Z5.h"  define="MKM32Z64xxx5"/>
          <debug      svd="SVD\MKM32Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP64_1KB.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        </device>

