t21/Walnut_X/Packages/.cache/Keil.Kinetis_KMxx_DFP.1.2.0.pdsc
        <!-- ******************************  MKM33Z128xxx5  ****************************** -->
        <device Dname="MKM33Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM33Z5.h"  define="MKM33Z128xxx5"/>
          <debug      svd="SVD\MKM33Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxCxx5RM.pdf" title="MKM33Z128xxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxCxx5.pdf"   title="MKM33Z128xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM33Z64xxx5  ****************************** -->
        <device Dname="MKM33Z64xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM33Z5.h"  define="MKM33Z64xxx5"/>
          <debug      svd="SVD\MKM33Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP64_1KB.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxCxx5RM.pdf" title="MKM33Z64xxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxCxx5.pdf"   title="MKM33Z64xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM34Z128xxx5  ****************************** -->
        <device Dname="MKM34Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM34Z5.h"  define="MKM34Z128xxx5"/>
          <debug      svd="SVD\MKM34Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxCxx5RM.pdf" title="MKM34Z128xxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxCxx5.pdf"   title="MKM34Z128xxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM38Z128xxx5  ****************************** -->
        <device Dname="MKM38Z128xxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM38Z5.h"  define="MKM38Z128xxx5"/>
          <debug      svd="SVD\MKM38Z5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
        </device>

        <!-- ******************************  MKM33Z64Axxx5  ****************************** -->
        <device Dname="MKM33Z64Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM33ZA5.h"  define="MKM33Z64Axxx5"/>
          <debug      svd="SVD\MKM33ZA5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP64_1KB.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM33Z128Axxx5  ****************************** -->
        <device Dname="MKM33Z128Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM33ZA5.h"  define="MKM33Z128Axxx5"/>
          <debug      svd="SVD\MKM33ZA5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>

        <!-- ******************************  MKM34Z128Axxx5  ****************************** -->
        <device Dname="MKM34Z128Axxx5">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="50000000"/>
          <compile header="Device\Include\MKM34ZA5.h"  define="MKM34Z128Axxx5"/>
          <debug      svd="SVD\MKM34ZA5.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFF000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP128_1KB.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\MKMxxZxxACxx5RM.pdf" title="MKM34Z128Axxx5 Device Reference Manual"/>
          <book name="Documents\MKMxxZxxACxx5.pdf"   title="MKM34Z128Axxx5 Device Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KM3x_256 ************************* -->
      <subFamily DsubFamily="KM3x_256">
        <description>
The Kinetis KM3x_256 MCUs are based on 32-bit ARM Cortex  M0+ core with integrated Analog
Front End (AFE). CPU clock rates on these devices can reach up to 75 MHz.
The KM3x_256 family of devices includes memory-mapped arithmetic unit (MMAU), highly
accurate Sigma Delta (SD) ADC, Programmable Gain Amplifier (PGA), high precision
internal voltage reference, flash, RAM, phase compensation logic block and other
peripherals.
KM3x_256 family also provides tamper detection and accurate real time clock on all devices.
        </description>

        <!-- ******************************  MKM34Z256xxx7  ****************************** -->
        <device Dname="MKM34Z256xxx7">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="75000000"/>
          <compile header="Device\Include\MKM34Z7.h"  define="MKM34Z256xxx7"/>
          <debug      svd="SVD\MKM34Z7.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x1FFFE000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash\MKMP256_2KB.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x20000000"  RAMsize="0x1000"  default="1"/>
          <book name="Documents\rev2RC_KM3x256_RM.pdf" title="MKM34Z256xxx7 Device Reference Manual"/>
          <!-- book name="Documents\MKMxxZxxACxx5.pdf"   title="MKM34Z256xxx7 Device Data Sheet"/-->
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="MKM13Z5 CMSIS">
      <description>Freescale Kinetis KM13 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM13Z64xxx5"/>
    </condition>

    <condition id="MKM14Z5 CMSIS">
      <description>Freescale Kinetis KM14 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM14Z64xxx5"/>
      <accept Dname="MKM14Z128xxx5"/>
    </condition>

    <condition id="MKM14ZA5 CMSIS">
      <description>Freescale Kinetis KM14A 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM14Z64Axxx5"/>
      <accept Dname="MKM14Z128Axxx5"/>
    </condition>

    <condition id="MKM32Z5 CMSIS">
      <description>Freescale Kinetis KM32 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM32Z64xxx5"/>
    </condition>

    <condition id="MKM33Z5 CMSIS">
      <description>Freescale Kinetis KM33 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM33Z64xxx5"/>
      <accept Dname="MKM33Z128xxx5"/>
    </condition>

    <condition id="MKM33ZA5 CMSIS">
      <description>Freescale Kinetis KM33A 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM33Z64Axxx5"/>
      <accept Dname="MKM33Z128Axxx5"/>
    </condition>

    <condition id="MKM34Z5 CMSIS">
      <description>Freescale Kinetis KM33 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM34Z128xxx5"/>
    </condition>

