t21/Walnut_X/Packages/.cache/Keil.Kinetis_KMxx_DFP.1.2.0.pdsc
    <condition id="MKM34ZA5 CMSIS">
      <description>Freescale Kinetis KM34A 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM34Z128Axxx5"/>
    </condition>

    <condition id="MKM38Z5 CMSIS">
      <description>Freescale Kinetis KM38 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM38Z128xxx5"/>
    </condition>

    <condition id="MKM34Z7 CMSIS">
      <description>Freescale Kinetis KM34 75MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Freescale:78"/>
      <accept Dname="MKM34Z256xxx7"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MKM13Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM13Z5 CMSIS">
      <description>System Startup for Kinetis KM13 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM13Z5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM13Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM13Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM14Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM14Z5 CMSIS">
      <description>System Startup for Kinetis KM14 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM14Z5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM14Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM14Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM14ZA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM14ZA5 CMSIS">
      <description>System Startup for Kinetis KM14A 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM14ZA5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM14ZA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM14ZA5.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKM14ZA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM32Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM32Z5 CMSIS">
      <description>System Startup for Kinetis KM32 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM32Z5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM32Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM32Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM33Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM33Z5 CMSIS">
      <description>System Startup for Kinetis KM33 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM33Z5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM33Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM33Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM33ZA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM33ZA5 CMSIS">
      <description>System Startup for Kinetis KM33A 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM33ZA5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM33ZA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM33ZA5.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKM33ZA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM34Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM34Z5 CMSIS">
      <description>System Startup for Kinetis KM34 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM34Z5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM34Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM34Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM34ZA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM34ZA5 CMSIS">
      <description>System Startup for Kinetis KM34A 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM34ZA5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM34ZA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM34ZA5.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKM34ZA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM38Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM38Z5 CMSIS">
      <description>System Startup for Kinetis KM38 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM38Z5.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM38Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM38Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM34Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM34Z7 CMSIS">
      <description>System Startup for Kinetis KM34A 50MHz Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="header"  name="Device\Include\MKM34Z7.h"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_MKM34Z7.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_MKM34Z7.c"      attr="config" version="1.0.0"/>
        <file category="header" name="Device\Source\system_MKM34Z7.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="TWR-KM34Z50MV3" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KM34Z50MV3 Board Support</description>
      <doc></doc>
      <component Cgroup="A/D Converter" condition="MKM34ZA5 CMSIS">
        <description>A/D Converter interface for Freescale TWR-KM34Z50MV3 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TWR-KM34Z50MV3\Common\ADC_TWR-KM34Z50MV3.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="MKM34ZA5 CMSIS">
      <description>Button driver for Freescale TWR-KM34Z50MV3 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TWR-KM34Z50MV3\Common\Buttons_TWR-KM34Z50MV3.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="MKM34ZA5 CMSIS">
      <description>LED driver for Freescale TWR-KM34Z50MV3 board</description>
        <files>
          <file category="source" name="Boards\Freescale\TWR-KM34Z50MV3\Common\LED_TWR-KM34Z50MV3.c"/>
        </files>
      </component>
    </bundle>
  </components>

