t21/Walnut_X/Packages/.cache/Keil.Kinetis_KMxx_DFP.1.2.0.pdsc
  <boards>
    <board name="TWR-KM34Z50" vendor="Freescale" revision="Rev. A" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>TWR-KM34Z50M: Kinetis M Series Tower System Module.</description>
      <book category="manual"    name="Documents\TWRKM34Z50UM.pdf" title="TWR-KM34Z50 Tower Module User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKM34Z128xxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KMxx Series" DsubFamily="KM3x"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="Reset, Tamper, two user button"/>
      <feature type="LED"            n="4"              name="user-controllable LEDs"/>
      <feature type="Accelerometer"  n="1"              name="MMA8491Q Three-axis accelerometer"/>
      <feature type="Poti"           n="1"              name="Potentiometer"/>
      <feature type="ContOther"      n="1"              name="NTC temperature sensor"/>
      <feature type="IrDA"           n="1"              name="IrDA support"/>
    </board>
  </boards>

  <boards>
    <board name="TWR-KM34Z50MV3" vendor="Freescale" revision="Rev. A2" salesContact="https://www.freescale.com/webapp/servicerequest.create_SR.framework">
      <description>TWR-KM34Z50MV3: Kinetis M Series Tower System Module.</description>
      <image small="Boards\Freescale\TWR-KM34Z50MV3\Documents\TWR-KM34Z50MV3_small.jpg"/>
      <book category="overview"  name="http://www.freescale.com/webapp/sps/site/prod_summary.jsp?code=TWR-KM34Z50M"  title="TWR-KM34Z50M: Kinetis M Series Tower System Module"/>
      <book category="manual"    name="Boards\Freescale\TWR-KM34Z50MV3\Documents\TWRKM34Z50UM.pdf" title="TWR-KM34Z50MV3 Tower Module User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Freescale:78" Dname="MKM34Z128Axxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="Freescale:78" Dfamily="KMxx Series" DsubFamily="KM3x"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="Reset, Tamper, two user button"/>
      <feature type="LED"            n="4"              name="user-controllable LEDs"/>
      <feature type="Accelerometer"  n="1"              name="MMA8491Q Three-axis accelerometer"/>
      <feature type="Poti"           n="1"              name="Potentiometer"/>
      <feature type="ContOther"      n="1"              name="NTC temperature sensor"/>
      <feature type="IrDA"           n="1"              name="IrDA support"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-KM34Z50 Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-KM34Z50\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KM34Z50" vendor="Freescale" Dvendor="Freescale:78" Dname="MKM34Z128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KM34Z50MV3 Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Freescale\TWR-KM34Z50MV3\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KM34Z50MV3" vendor="Freescale" Dvendor="Freescale:78" Dname="MKM34Z128Axxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
